app/controllers/memos_controller.rb

SELECT `memos`.* FROM `memos`
---
  def index
    @memos = Memo.all

SELECT  `memos`.* FROM `memos`  WHERE `memos`.`id` = 1 LIMIT 1
---
    def set_memo
      @memo = Memo.find(params[:user_id])